; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v3)
             (pred_3 ?v1 ?v11)
             (pred_9 ?v4 ?v11)
             (pred_4 ?v13 ?v4 )
	     (pred_2 ?v4)
             (pred_11 ?v10)
             (pred_12 ?v1)
             (pred_1 ?v11)
             (pred_6 ?v4)
             (pred_7 ?v1)
             (pred_8 ?v4)
             (pred_5 ))



(:action op_1
:parameters (?v9 ?v2 ?v8 ?v7)
:precondition (and (pred_11 ?v9) (pred_11 ?v2) (pred_12 ?v8) (pred_1 ?v7)
          (pred_10 ?v9 ?v2) (pred_3 ?v8 ?v7)
                   (pred_9 ?v2 ?v7) (pred_2 ?v9) 
                   (pred_6 ?v2) (pred_7 ?v8))
:effect (and  (pred_8 ?v2) (not (pred_6 ?v2))))


(:action op_5
:parameters (?v9 ?v5)
:precondition (and (pred_11 ?v9) (pred_11 ?v5)
               (pred_2 ?v9) (pred_10 ?v9 ?v5) (pred_8 ?v5))
:effect (and (pred_2 ?v5) (not (pred_2 ?v9))))

(:action op_3
:parameters (?v9 ?v8)
:precondition (and (pred_11 ?v9) (pred_12 ?v8) 
                  (pred_2 ?v9) (pred_4 ?v8 ?v9) (pred_5 ))
:effect (and (pred_7 ?v8)
   (not (pred_4 ?v8 ?v9)) (not (pred_5 ))))


(:action op_4
:parameters (?v9 ?v12 ?v6)
:precondition (and (pred_11 ?v9) (pred_12 ?v12) (pred_12 ?v6)
                  (pred_2 ?v9) (pred_7 ?v6) (pred_4 ?v12 ?v9))
:effect (and (pred_7 ?v12) (pred_4 ?v6 ?v9)
        (not (pred_7 ?v6)) (not (pred_4 ?v12 ?v9))))

(:action op_2
:parameters (?v9 ?v8)
:precondition (and (pred_11 ?v9) (pred_12 ?v8) 
                  (pred_2 ?v9) (pred_7 ?v8))
:effect (and (pred_5 ) (pred_4 ?v8 ?v9) (not (pred_7 ?v8)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_04 obj_07 obj_17 obj_14 obj_13 obj_01 obj_08 obj_03 obj_10 obj_12 obj_16 obj_02 obj_05 obj_09 obj_15
    obj_19 obj_18
    obj_06 obj_20
    )

    (:init
       (pred_5)

       (pred_11 obj_11)
       (pred_11 obj_04)
       (pred_11 obj_07)
       (pred_11 obj_17)
       (pred_11 obj_14)
       (pred_11 obj_13)
       (pred_11 obj_01)
       (pred_11 obj_08)
       (pred_11 obj_03)
       (pred_11 obj_10)
       (pred_11 obj_12)
       (pred_11 obj_16)
       (pred_11 obj_02)
       (pred_11 obj_05)
       (pred_11 obj_09)
       (pred_11 obj_15)
       (pred_1 obj_19)
       (pred_1 obj_18)
       (pred_12 obj_06)
       (pred_12 obj_20)

       (pred_10 obj_11 obj_14)
       (pred_10 obj_11 obj_04)
       (pred_10 obj_04 obj_13)
       (pred_10 obj_04 obj_07)
       (pred_10 obj_04 obj_11)
       (pred_10 obj_07 obj_01)
       (pred_10 obj_07 obj_17)
       (pred_10 obj_07 obj_04)
       (pred_10 obj_17 obj_08)
       (pred_10 obj_17 obj_07)
       (pred_10 obj_14 obj_03)
       (pred_10 obj_14 obj_13)
       (pred_10 obj_14 obj_11)
       (pred_10 obj_13 obj_10)
       (pred_10 obj_13 obj_01)
       (pred_10 obj_13 obj_04)
       (pred_10 obj_13 obj_14)
       (pred_10 obj_01 obj_12)
       (pred_10 obj_01 obj_08)
       (pred_10 obj_01 obj_07)
       (pred_10 obj_01 obj_13)
       (pred_10 obj_08 obj_16)
       (pred_10 obj_08 obj_17)
       (pred_10 obj_08 obj_01)
       (pred_10 obj_03 obj_02)
       (pred_10 obj_03 obj_10)
       (pred_10 obj_03 obj_14)
       (pred_10 obj_10 obj_05)
       (pred_10 obj_10 obj_12)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_10 obj_03)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_12 obj_01)
       (pred_10 obj_12 obj_10)
       (pred_10 obj_16 obj_15)
       (pred_10 obj_16 obj_08)
       (pred_10 obj_16 obj_12)
       (pred_10 obj_02 obj_05)
       (pred_10 obj_02 obj_03)
       (pred_10 obj_05 obj_09)
       (pred_10 obj_05 obj_10)
       (pred_10 obj_05 obj_02)
       (pred_10 obj_09 obj_15)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_09 obj_05)
       (pred_10 obj_15 obj_16)
       (pred_10 obj_15 obj_09)
       (pred_6 obj_02)
       (pred_6 obj_16)
       (pred_9  obj_02 obj_19)
       (pred_9  obj_16 obj_18)
       (pred_8 obj_11)
       (pred_8 obj_04)
       (pred_8 obj_07)
       (pred_8 obj_17)
       (pred_8 obj_14)
       (pred_8 obj_13)
       (pred_8 obj_01)
       (pred_8 obj_08)
       (pred_8 obj_03)
       (pred_8 obj_10)
       (pred_8 obj_12)
       (pred_8 obj_05)
       (pred_8 obj_09)
       (pred_8 obj_15)

       (pred_3  obj_06 obj_19)
       (pred_3  obj_20 obj_18)
       (pred_4 obj_06 obj_08)
       (pred_4 obj_20 obj_15)
       (pred_2 obj_17)
    )

    (:goal (and
       (pred_4 obj_20 obj_13)
    ))
(:constraints
  (always (not (pred_2 obj_01)))
)
)

; plan
1. (op_5 obj_17 obj_08)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_08)
   goals met: 0 of 1
2. (op_3 obj_08 obj_06)
   deleted: (pred_4 obj_06 obj_08) (pred_5)
   added: (pred_7 obj_06)
   goals met: 0 of 1
3. (op_5 obj_08 obj_17)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_17)
   goals met: 0 of 1
4. (op_5 obj_17 obj_07)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_07)
   goals met: 0 of 1
5. (op_5 obj_07 obj_04)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_04)
   goals met: 0 of 1
6. (op_5 obj_04 obj_13)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_13)
   goals met: 0 of 1
7. (op_2 obj_13 obj_06)
   deleted: (pred_7 obj_06)
   added: (pred_5) (pred_4 obj_06 obj_13)
   goals met: 0 of 1
8. (op_5 obj_13 obj_10)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_10)
   goals met: 0 of 1
9. (op_5 obj_10 obj_12)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_12)
   goals met: 0 of 1
10. (op_5 obj_12 obj_09)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_09)
   goals met: 0 of 1
11. (op_5 obj_09 obj_15)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_15)
   goals met: 0 of 1
12. (op_3 obj_15 obj_20)
   deleted: (pred_4 obj_20 obj_15) (pred_5)
   added: (pred_7 obj_20)
   goals met: 0 of 1
13. (op_5 obj_15 obj_09)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_09)
   goals met: 0 of 1
14. (op_5 obj_09 obj_12)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_12)
   goals met: 0 of 1
15. (op_5 obj_12 obj_10)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_10)
   goals met: 0 of 1
16. (op_5 obj_10 obj_13)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_13)
   goals met: 0 of 1
17. (op_4 obj_13 obj_06 obj_20)
   deleted: (pred_7 obj_20) (pred_4 obj_06 obj_13)
   added: (pred_7 obj_06) (pred_4 obj_20 obj_13)
   goals met: 1 of 1
